# RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution Property
ParameterTypeId Class See Also
---
"Analytical Space Resolution"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace